clc
clear
list={'2007','2010','2012','2013','2014','2015','2016','2017','2018','2019-01','2019-03','2019-04','2019-05','2019-06', '2019-07','2019-08','2019-09','2019-10','2019-11','2019-12','2020-01','2020-02','2020-03','2020-04','2020-05', '2020-06','2020-07','2020-08','2020-09','2020-10','2020-11','2020-12'};
str1='G:\代码\Python\杨宇铮\坐标\';
str2='.xlsx';
for i=28:32
    str=[str1,list{i},str2];
    num = xlsread(str);
    x=num(:,1);
    y=num(:,2);
    figure(i)
    ax=worldmap([45 50],[-125 -116]);
    %setm(ax, 'Origin', [49 -122 0]);  %设置坐标轴属性，[0,0,0]表示地图中心的经纬度高度
    land = shaperead('landareas', 'UseGeoCoords', true); %导入陆地框架
    geoshow(ax, land, 'FaceColor', [0.5 0.7 0.5]); %展示地图
    scatterm(x,y,50,'filled') 
end
    